priv/soap_test.xml

<?xml version="1.0" ?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <i:ReserveAmount xmlns:i="http://www.example.org">
      <i:AccountNumber>ACCOUNT</i:AccountNumber>
      <i:Amount>AMOUNT</i:Amount>
    </i:ReserveAmount>
  </soap:Body>
</soap:Envelope>
